---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManager.IsDocLvlMacro
source: html/76941534-0983-c6f9-bcec-ad38991f17b5.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.IsDocLvlMacro Method

Indicates current Macro is document level

## Syntax (C#)
```csharp
public bool IsDocLvlMacro()
```

## Returns
Returns true if is document level, false otherwise.